# Project Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Curve..::..Project Method
Curve Class See Also
---
Projects the specified point on this curve.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public IntersectionResult Project(
	XYZ point
)
```

Visual Basic
---
```text
Public Function Project ( _
	point As XYZ _
) As IntersectionResult
```

Visual C++
---
```text
public:
IntersectionResult^ Project(
	XYZ^ point
)
```

# ### Parameters
point
    Type: Autodesk.Revit.DB..::..XYZThe point to be projected.
# ### Return Value
Geometric information if projection is successful.
# Remarks
The following is the meaning of every IntersectionResult's members:
  * XYZPoint is the nearest point on the curve;
  * Parameter is the unnormalized parameter on the curve (use ComputeNormalizedParameter to compute the normalized value)
  * Distance is the distance from the point to the curve (equivalent to Distance).

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when the curve is an arc and either its radius is zero or the input point is the center of the arc. Thrown when the curve is an elliptical arc and the input point is one of the foci of the elliptical arc. |

# See Also
Curve Class
Autodesk.Revit.DB Namespace